[About Language File]
Version=9.2.0
Date=27.08.2014
Author=SATIT  ARCHANUSORN
Email=acha937@gmail.com
Comments=I translate Thai. Thank you.

[MainForm]
ActionDocument=&เอกสาร(Document)
ActionDocumentFormat=แบบแผน
ActionDocumentFormatSQL:h=แบบแผนSQL
ActionDocumentFormatSQL=แบบแผน SQL
ActionDocumentFormatXML:h=แบบแผน  XML
ActionDocumentFormatXML=&แบบแผน XML
ActionDocumentInfo:h=การนับเส้น, คำ, และตัวอักษร
ActionDocumentInfo=&เส้น, คำ, และตัวอักษรการนับ...
ActionDocumentViewInBrowser:h=มุมมองเอกสารปัจจุบันในการค้นหาขั้นพื้นฐาน
ActionDocumentViewInBrowser:s=Alt+B
ActionDocumentViewInBrowser=&มุมมองในการค้นหา
ActionEdit=แก้&ไข (Edit)
ActionEditCopy:h=การเลือกทำสำเนาและใส่มันไปยังคลิปบอร์ด
ActionEditCopy:s=Ctrl+C
ActionEditCopy=ทำ&สำเนา (Copy)
ActionEditCut:h=ตัดการเลือกและใส่มันไปยังคลิปบอร์ด
ActionEditCut:s=Ctrl+X
ActionEditCut=ตัด&(Cut)
ActionEditDecreaseIndent:h=ลดไม่รอยเว้า
ActionEditDecreaseIndent:s=Shift+Ctrl+U
ActionEditDecreaseIndent=&ลดลง(Decrease)
ActionEditDelete=ลบ& (Delete)
ActionEditDeleteEndOfLine:h=ลบตอนจบของเส้น
ActionEditDeleteEndOfLine:s=การเปลี่ยนแปลง+Ctrl+Y
ActionEditDeleteEndOfLine=&ตอนจบของเส้น
ActionEditDeleteLine:h=ลบเส้น
ActionEditDeleteLine:s=Ctrl+Y
ActionEditDeleteLine=&เส้น
ActionEditDeleteWhitespace:h=เอา whitespace ทั้งหมด ออก จากข้อความที่เลือก
ActionEditDeleteWhitespace=W&hitespace
ActionEditDeleteWord:h=ลบคำ
ActionEditDeleteWord:s=Ctrl+T
ActionEditDeleteWord=&คำ
ActionEditIncreaseIndent:h=เพิ่มไม่รอยเว้า
ActionEditIncreaseIndent:s=Shift+Ctrl+I
ActionEditIncreaseIndent=เพิ่มขึ้น
ActionEditIndent=I&ndent
ActionEditInsert=สอดใส่ (Insert)
ActionEditInsertDateTime:h=ใส่วันที่และเวลา
ActionEditInsertDateTime:s=Shift+Alt+D
ActionEditInsertDateTime=&วันที่และเวลา
ActionEditInsertLine:h=สอดใส่เส้น
ActionEditInsertLine:s=Ctrl+เข้าไป
ActionEditInsertLine=บรร&ทัด(Line)
ActionEditInsertTag:h=ใส่ HTML/XML ติดป้าย
ActionEditInsertTag:s=Shift+Ctrl+T
ActionEditInsertTag=&HTML/XML ติดป้าย...
ActionEditPaste:h=ใส่สิ่งที่บรรจุคลิปบอร์ด
ActionEditPaste:s=Ctrl+V
ActionEditPaste=วางแปะ& (Paste)
ActionEditRedo:h=ดำเนินการใหม่กับการกระทำที่ไม่ดำเนินการที่ผ่านมา
ActionEditRedo:s=Shift+Ctrl+Z
ActionEditRedo=ดำเนิน&การใหม่(Redo)
ActionEditSelectAll:h=เลือกทั้งหมด
ActionEditSelectAll:s=Ctrl+A
ActionEditSelectAll=เลือก&ทั้งหมด(Select all)
ActionEditSort=ช&นิด(Sort)
ActionEditSortAsc:h=การเฟื่องฟูชนิด
ActionEditSortAsc:s=Shift+Ctrl+A
ActionEditSortAsc=&การเฟื่องฟู
ActionEditSortDesc:h=ชนิดการลงมาชนิด
ActionEditSortDesc:s=Shift+Ctrl+D
ActionEditSortDesc=&การลงมา
ActionEditToggleCase:h=เปลี่ยนกรณี
ActionEditToggleCase:s=Shift+Ctrl+C
ActionEditToggleCase=เพื่อ&กรณี
ActionEditUndo:h=ไม่ดำเนินการ-การกระทำสุดท้าย
ActionEditUndo:s=Ctrl+Z
ActionEditUndo=ไม่&ดำเนินการ(Undo)
ActionFile=&ไฟล์ (File)
ActionFileClose:h=ปิดเอกสารสำคัญ
ActionFileClose:s=Ctrl+F4
ActionFileClose=&ปิด (Close)
ActionFileCloseAll:h=ปิดไฟล์ที่เปิดอยู่ทั้งหมด
ActionFileCloseAll=ปิด&ทั้งหมด (Close all)
ActionFileCloseAllOther:h=ปิดหน้าอื่นๆทั้งหมด
ActionFileCloseAllOther:s=Shift+Ctrl+F4
ActionFileCloseAllOther=ปิด&ไฟล์อื่นๆทั้งหมด
ActionFileExit:h=ออกจากแอปปลิเคชั่น
ActionFileExit:s=Alt+F4
ActionFileExit=ออ&ก (Exit)
ActionFileNew:h=สร้างเอกสารใหม่
ActionFileNew:s=Ctrl+N
ActionFileNew=&ใหม่ (New)
ActionFileOpen:h=เปิดเอกสารที่มีอยู่
ActionFileOpen:s=Ctrl+O
ActionFileOpen=&เปิด (Open)...
ActionFilePrint:h=พิมพ์เอกสารสำคัญ
ActionFilePrint:s=Ctrl+P
ActionFilePrint=พิม&พ์ (Print)...
ActionFilePrintPreview:h=ตัวอย่างต้นฉบับเอกสารสำคัญ
ActionFilePrintPreview=พิมพ์&ตัวอย่างต้นฉบับ(Print preview)...
ActionFileProperties:h=ดูคุณสมบัติไฟล์
ActionFileProperties=คุณสม&บัติ (Properties)...
ActionFileReopen=&เปิดใหม่(Reopen)
ActionFileReopenClear=&ลบล้าง (Clear)
ActionFileSave:h=บันทึกเอกสารสำคัญ
ActionFileSave:s=Ctrl+S
ActionFileSave=&บันทึก (Save)
ActionFileSaveAll:h=บันทึกเอกสารทั้งหมด
ActionFileSaveAll:s=Shift+Ctrl+S
ActionFileSaveAll=บันทึก&ทั้งหมด (Save all)
ActionFileSaveAs:h=บันทึกเอกสารสำคัญโดยเปลี่ยนชื่อใหม่
ActionFileSaveAs:s=Ctrl+Alt+S
ActionFileSaveAs=บัน&ทึกเป็น (Save as)...
ActionFileSelectFromDirectory:h=เลือกไฟล์จากไดเรคทอรี่ที่ใช้งาน
ActionFileSelectFromDirectory=เลือกจากไดเรคทอรี่
ActionHelp=&ช่วยเหลือ(Help)
ActionHelpAboutEditBone:h=แสดงข้อมูลเบื้องต้นเกี่ยวกับ EditBone
ActionHelpAboutEditBone=&เกี่ยวกับ EditBone
ActionHelpCheckForUpdates:h=ตรวจหาของใหม่
ActionHelpCheckForUpdates=&ตรวจหาของใหม่
ActionHelpVisitHomepage:h=เยี่ยม EditBone โฮมเพ็จ - http://www.bonecode.com/
ActionHelpVisitHomepage=&เยี่ยมโฮมเพ็จ
ActionMacroOpen:h=เปิดmacro ที่มีอยู่
ActionMacroOpen=&เปิด (Open)...
ActionMacroPlayback:h=การเล่น macro
ActionMacroPlayback:s=Shift+Ctrl+P
ActionMacroPlayback=&การเล่น
ActionMacroRecordPause:h=บันทึกหรือหยุดพัก macro
ActionMacroRecordPause:s=Shift+Ctrl+R
ActionMacroRecordPause=&บันทึก (Record)
ActionMacroSaveAs:h=บันทึก macro กับชื่อใหม่
ActionMacroSaveAs=บั&นทึกเป็น...
ActionMacroStop:h=หยุด การบันทึก macro
ActionMacroStop:s=Shift+Ctrl+S
ActionMacroStop=&หยุด (Stop)
ActionSearch=&การค้นหา (Search)
ActionSearchClearBookmarks:h=ทำความสะอาดที่คั่นหนังสือทั้งหมด
ActionSearchClearBookmarks=ลบล้าง &ที่คั่นหนังสือ
ActionSearchFindInFiles:h=ค้นหาข้อความในหลายไฟล์
ActionSearchFindInFiles:s=Shift+Ctrl+F
ActionSearchFindInFiles=ค้นหา&ในไฟล์...
ActionSearchFindNext:h=ค้นหาข้อความที่จับคู่ถัดไป
ActionSearchFindNext:s=F3
ActionSearchFindNext=การค้นหา&ถัดไป
ActionSearchFindPrevious:h=ค้นหาข้อความที่จับคู่ที่ผ่านมา
ActionSearchFindPrevious:s=Shift+F3
ActionSearchFindPrevious=การค้นหา&ที่ผ่านมา
ActionSearchGoToBookmarks:h=ไปที่คั่นหนังสือ
ActionSearchGoToBookmarks=ไปที่คั่นหนังสือ
ActionSearchGoToLine:h=ไปที่เส้น
ActionSearchGoToLine:s=Ctrl+G
ActionSearchGoToLine=ไปที่เส้น
ActionSearchReplace:h=เคลื่อนย้ายข้อความที่เจาะจงกับข้อความที่แตกต่าง
ActionSearchReplace:s=Ctrl+R
ActionSearchReplace=&แทนที่ (Replace)...
ActionSearchSearch:h=ค้นหาข้อความที่เจาะจง
ActionSearchSearch:s=Ctrl+F
ActionSearchSearch=การ&ค้นหา(Search)...
ActionSearchToggleBookmark:h=ชุดหรือที่คั่นหนังสือชัดเจนที่บรรทัดปัจจุบัน. ที่คั่นหนังสือสามารถยังถูกตั้งโดยการใช้ Ctrl+Shift+1..9. ไปที่ที่คั่นหนังสือโดยการใช้ Ctrl+1..9.
ActionSearchToggleBookmark:s=Ctrl+F2
ActionSearchToggleBookmark=&เปลี่ยนที่คั่นหนังสือ
ActionSearchToggleBookmarks:h=เปลี่ยนที่คั่นหนังสือ
ActionSearchToggleBookmarks=ที่&คั่นหนังสือ
ActionToolBarMenuLanguage=&ภาษา (Language)
ActionToolBarMenuSkin=ส&ไตส์(Style)
ActionTools=&เครื่องมือ (Tools)
ActionToolsCharacterMap:h=ใส่ตัวอักษร unicode เพื่อเอกสารที่ตื่นตัวโดยกดdouble-clicking
ActionToolsCharacterMap=&ตัวอักษรถอดรห้ส Unicode ...
ActionToolsCompareFiles:h=เปรียบเทียบไฟล์
ActionToolsCompareFiles=&เปรียบเทียบไฟล์...
ActionToolsConvert:h=แปลงหน่วย numerical
ActionToolsConvert=กลับเปลี่ยน& (Convert)...
ActionToolsLanguageEditor:h=ตัวแก้ไขภาษา
ActionToolsLanguageEditor=&ผู้แก้ไขภาษา(Language editor)...
ActionToolsOptions:h=ข้อกำหนดทางเลือก
ActionToolsOptions=ทาง&เลือก (Options)...
ActionToolsSelectForCompare:h=เลือกเอกสารสำหรับเปรียบเทียบ
ActionToolsSelectForCompare=เลือกสำหรับเปรียบเทียบ...
ActionView=&มุมมอง  (View)
ActionViewCloseDirectory:h=ปิดไดเรคทอรี่ที่ใช้งาน
ActionViewCloseDirectory:s=Shift+Ctrl+D
ActionViewCloseDirectory=&ปิดไดเรคทอรี่(Close directory)
ActionViewDirectory:h=แสดงหรือซ่อนไดเรคทอรี่
ActionViewDirectory=&ไดเรคทอรี่
ActionViewEditDirectory:h=แก้ไขไดเรคทอรี่ที่ใช้งาน
ActionViewEditDirectory:s=Shift+Ctrl+E
ActionViewEditDirectory=&แก้ไขไดเรคทอรี่...
ActionViewEncodingSelection:h=แสดงหรือซ่อนการเลือกที่เข้ารหัส
ActionViewEncodingSelection=การถอด&รหัส(Encoding)
ActionViewFiles:h=การค้นหาไฟล์จากไดเรคทอรี่ที่เลือกและไดเรคทอรี่ย่อยของมัน
ActionViewFiles:s=Ctrl+F12
ActionViewFiles=&ไฟล์(Files)...
ActionViewHighlighterSelection:h=แสดงหรือซ่อนการเลือกhighlighter
ActionViewHighlighterSelection=&highlighter
ActionViewLineNumbers:h=เปลี่ยนหมายเลขเส้น
ActionViewLineNumbers=หมายเลข&เส้น
ActionViewMiniMap:h=แสดงหรือซ่อน minimap
ActionViewMiniMap=Minimap
ActionViewNextPage:h=ไปที่หน้าถัดไป
ActionViewNextPage:s=Ctrl+Tab
ActionViewNextPage=&หน้าถัดไป
ActionViewOpenDirectory:h=เปิดไดเรคทอรี่ใหม่
ActionViewOpenDirectory:s=Ctrl+D
ActionViewOpenDirectory=&เปิดไดเรคทอรี่(Open directory)...
ActionViewOutput:h=แสดงหรือซ่อนสิ่งที่นำออก
ActionViewOutput=O&utput
ActionViewPreviousPage:h=ไปที่หน้าที่ผ่านมา
ActionViewPreviousPage:s=Shift+Ctrl+Tab
ActionViewPreviousPage=&หน้าที่ผ่านมา
ActionViewSelectionMode:h=เปลี่ยนโหมดการเลือก. ยังการกด Alt บนตัวแก้จะเปลี่ยนโหมดการเลือก.
ActionViewSelectionMode=การเลือก &โหมด
ActionViewSpecialChars:h=เปลี่ยนตัวอักษรพิเศษ
ActionViewSpecialChars=ตัวอักษรพิเศษ&(Special chars)
ActionViewSplit:h=แบ่งเอกสาร
ActionViewSplit=&แบ่ง (Split)
ActionViewStatusBar:h=แสดงหรือซ่อนแถบสถานะ
ActionViewStatusBar=&แถบสถานะ (Status bar)
ActionViewToolbar:h=แสดงหรือซ่อนแถบเครื่องมือ
ActionViewToolbar=&แถบเครื่องมือ(Toolbar)
ActionViewWordWrap:h=เปลี่ยนWord wrap
ActionViewWordWrap=&Word wrap
ActionViewXMLTree:h=แสดงหรือซ่อน XML tree
ActionViewXMLTree=&XML tree

[UnicodeCharacterMapForm]
Caption=Unicode Character Map

[AskYesOrNo]
CancelSearch=ยกเลิกการค้นหา, คุณแน่ใจไหม?
CloseDirectory=ปิดไดเรคทอรี่ %s, คุณแน่ใจ ไหม?
DeleteDirectory=ลบไดเรคทอรี่ %s, คุณแน่ใจไหม?
DeleteFile=ลบไฟล์ %s, คุณแน่ใจไหม?
DeleteLine=ลบบรรทัด, คุณแน่ใจไหม?
DocumentTimeChanged=เอกสาร %เวลา/วันที่เปลี่ยน. โหลดใหม่?
NewVersion=เวอร์ชันใหม่ %s ของ %s มีให้.%sคุณชอบดาวน์โหลดมันจากอินเตอร์เนต?
RecordMacro=บันทึกmacro ใหม่, คุณแน่ใจไหม?
ReplaceOccurence=เคลื่อนย้ายแทนที่ occurence นี้ ของ '%s'?
SaveChanges=บันทึกการเปลี่ยนแปลง?
SearchMatchNotFound=การค้นหาไม่ค้นพบ.%การเริ่มต้นค้นหาจากไฟล์?
SearchStringNotFound=ข้อความการค้นหา '%s' ไม่ค้นพบ

[Message]
CannotFindString=ไม่สามารถค้นหาข้อความ '%s'
DocumentStatistics=การนับบรรทัด: %d%Word count: %d%sCharacter การนับ: %d
LatestVersion=คุณกำลังใช้เวอร์ชันล่าสุด.

[ErrorMessage]
EnterPath=Enter path.
EnterPath:t=Translation needed
EnterTabName=เข้าไปแถบชื่อ.
FileNotFound=ไม่ค้นพบ %s'ไฟล์ .
PathNotExist=Path does not exist.
PathNotExist:t=Translation needed
RootDirectoryNotExist=ไดเรคทอรี่รากไม่มีอยู่.

[WarningMessage]
FileAccessError=ไฟล์ %s ข้อผิดพลาดที่เข้าถึง.

[Constant]
AllFiles=ไฟล์ทั้งหมด
Arrow:t=Translation needed
Arrow=Arrow
AutoSave=บันทึกอัตโนมัติ
Block=สกัดกั้น
Bookmark=ที่คั่นหนังสือ
Bottom=ด้านล่าง
Circle=Circle
Circle:t=Translation needed
Color=Color
Color:t=Translation needed
CompareFiles=เปรียบเทียบไฟล์
CountingFiles=การนับไฟล์...
Document=เอกสาร(Document)
Dot=Dot
Dot:t=Translation needed
DownloadCancelling=การยกเลิก...
DownloadDone=ทำ.
EditDirectory=ผู้แก้ไขไดเรคทอรี่
Encoding=Encoding
Encoding:t=Translation needed
FilesFound=%dไฟล์(s) ได้ถูกค้นพบใน %s
FooterLeft=ข้อความท้ายหน้า - ด้านซ้าย
FooterRight=ข้อความท้ายหน้า - ด้านขวา
GoToLine=Go to line
GoToLine:t=Translation needed
HalfBlock=Half block
HeaderLeft=หัวข้อ - ด้านซ้าย
HeaderRight=หัวข้อ - ด้านขวา
Hide=ซ่อน
Highlighter=Highlighter
Highlighter:t=Translation needed
HorizontalLine=เส้นแนวนอน
Insert=ใส่(Insert)
InsertTags=Insert HTML/XML Tags
InsertTags:t=Translation needed
InvalidName=Invalid name
InvalidName:t=Translation needed
LanguageEditor=ผู้แก้ไขภาษา - [%s]
Line=เส้น
MatchFound=%d match%s found
MatchFound:t=Translation needed
MatchFoundPluralExtension=es
MatchFoundPluralExtension:t=Translation needed
Minute=ต่ำสุด
Modified=ปรับแต่ง
OccurencesFound=%d occurence(s) ได้ถูกค้นพบใน %s
Open=เปิด
OpenDirectory=ไดเรคทอรี่เปิด
Overwrite=เขียนทับ
Pilcrow=Pilcrow
Pilcrow:t=Translation needed
PreviewDocumentPage=หน้า: $PAGENUM$ ของ $PAGECOUNT$
PreviewPage= หน้า: %d
PreviewPrintDocument=การพิมพ์ (%s)|พิมพ์เอกสารบน %s
PrintedBy=พิมพ์โดย %s
Rename=คุณต้องการเปลี่ยนชื่อ %s เพื่อ %s %ไหม?
RenameFailed=%s rename failed
RenameFailed:t=Translation needed
SaveAs=บันทึกเป็น
SearchFor=ค้นหาเพื่อ '%s'
Second =s
SelectRootDirectory=เลือกรากไดเรคทอรี
Solid=Solid
Solid:t=Translation needed
Square=Square
Square:t=Translation needed
ThinHorizontalLine=Thin horizontal line
ThinHorizontalLine:t=Translation needed
ThinVerticalLine=Thin vertical line
ThinVerticalLine:t=Translation needed
Top=ด้านบน
TopLine=บรรทัดบนสุด: %d
VersionInfoNotFound=คำแนะนำเวอร์ชันไม่ค้นพบ.
VerticalLine=เส้นแนวดิ่ง

[DialogConstant]
SMsgDlgAbort=&หลีกเลี่ยง(Abort)
SMsgDlgAll=&ทั้งหมด
SMsgDlgCancel=ยกเลิก
SMsgDlgClose=&ปิด(Close)
SMsgDlgConfirm=ยืนยัน
SMsgDlgError=ข้อผิดพลาด
SMsgDlgHelp=&ช่วยเหลือ (Help)
SMsgDlgHelpHelp=ช่วยเหลือ (Help)
SMsgDlgHelpNone=ไม่มีความช่วยเหลือให้
SMsgDlgIgnore=&ไม่สนใจ(Ignore)
SMsgDlgInformation=ข้อมูลเบื้องต้น
SMsgDlgNo=&ไม่
SMsgDlgNoToAll=ไม่& ทั้งหมด
SMsgDlgOK=คกลง(OK)
SMsgDlgRetry=&ความพยายาม(Retry)
SMsgDlgWarning=การเตือน
SMsgDlgYes=&ใช่
SMsgDlgYesToAll=ใช่ &ทั้งหมด

[ColorConstant]
clBlack=ดำ
clMaroon=Maroon
clGreen=สีเขียว
clOlive=Olive
clNavy=Navy
clPurple=สีม่วง
clTeal=สีเขียวน้ำทะเล
clGray=สีเทา
clSilver=เงิน
clRed=สีแดง
clLime=ปูนขาว
clYellow=สีเหลือง
clBlue=สีน้ำเงิน
clFuchsia=Fuchsia
clAqua=Aqua
clWhite=สีขาว
clMoneyGreen=สีเขียวเงิน
clSkyBlue=สีฟ้า
clCream=ครีม
clMedGray=สีเทากลาง
clActiveBorder=พรมแดนที่ตื่นตัว
clActiveCaption=หัวเรื่องที่ตื่นตัว
clAppWorkSpace=workspace แอปปลิเคชั่น
clBackground=พื้นหลัง
clBtnFace=หน้าปุ่ม
clBtnHighlight=Button highlight
clBtnShadow=Button shadow
clBtnText=ข้อความปุ่ม
clCaptionText=ข้อความหัวเรื่อง
clDefault=ข้อกำหนดพื้นฐาน(Default)
clGradientActiveCaption=Gradient หัวเรื่องที่ตื่นตัว
clGradientInactiveCaption=Gradient ไม่ตอบสนองหัวเรื่อง
clGrayText=ข้อความสีเทา
clHighlight=Highlightพื้นหลัง
clHighlightText=Highlight text
clHotLight=Hot light
clInactiveBorder=ไม่ตอบสนองพรมแดน
clInactiveCaption=ไม่ตอบสนองหัวเรื่อง
clInactiveCaptionText=ไม่ตอบสนองข้อความหัวเรื่อง
clInfoBk=คำแนะนำพื้นหลัง
clInfoText=ข้อความคำแนะนำ
clMenu=พื้นหลังเมนู
clMenuBar=แถบเมนู
clMenuHighlight=Menu highlight
clMenuText=ข้อความเมนู
clNone=ไม่มี
clScrollBar=Scroll bar
cl3DDkShadow=เงาที่มืด 3D
cl3DLight=ความสว่าง 3D
clWindow=พื้นหลังวินโดว์ส
clWindowFrame=เฟรมวินโดว์ส
clWindowText=ข้อความวินโดว์ส

[FileTypes]
Assembler 68HC11=68HC11 ตัวแปลภาษาแอสเซมบลีไฟล์ (*.hc11;*.asc)
AutoIt v3=AutoIt ไฟล์ (*.au3)
AWK=AWK scripts (*.awk)
C#=C# ไฟล์ (*.cs)
C++=C/C++ ไฟล์ (*.c;*.cpp;*.h;*.hpp)
CSS=Cascading Stylesheet ไฟล์ (*.css)
Delphi Form Module=Delphi Form Module ไฟล์ (*.dfm)
HTML with Scripts=HTML ไฟล์ (*.html;*.htm)
Java=Java ไฟล์ (*.java)
JavaScript=JavaScript ไฟล์ (*.js)
JSON=JSON ไฟล์ (*.json)
MS-DOS Batch=MS-DOS Batch ไฟล์ (*.bat;*.cmd)
Object Pascal=Pascal ไฟล์ (*.pas;*.dfm;*.dpr;*.dproj)
Perl=Perl ไฟล์ (*.pl;*.pm;*.cgi)
PHP=PHP ไฟล์ (*.php;*.class;*.inc)
Python=Python ไฟล์ (*.py)
Ruby=Ruby ไฟล์ (*.rb;*.rbw)
SQL=SQL ไฟล์ (*.sql)
Visual Basic=Visual Basic ไฟล์ (*.vb;*.bas)
XML=XML ไฟล์ (*.xml;*.xsd;*.xsl;*.xslt;*.dtd)
Macro=Macro files (*.mcr)|*.mcr
Language=Language files (*.lng)|*.lng
Macro=Macro ไฟล์  (*.mcr)|*.mcr
Language=ไฟล์ภาษา (*.lng)|*.lng

[ConfirmReplaceDialog]
ButtonCancel=ยกเลิก
Caption=ยืนยันแทนที่
ButtonNo=&ไม่มี
ButtonYes=&ใช่
ButtonYesToAll=ใช่เพื่อ&ทั้งหมด

[DownloadURLDialog]
ButtonCancel=ยกเลิก
Caption=ดาวน์โหลด

[FindInFilesDialog]
ButtonCancel=ยกเลิก
Caption=ค้นหาในไฟล์
CheckBoxCaseSensitive=กรณีรู้สึกอ่อนไหว
ComboBoxFileMask=หน้ากากไฟล์
ButtonFind=&การค้นหา
ComboBoxTextToFind=ข้อความเพื่อค้นหา
ComboBoxDirectory=ไดเรคทอรี่
CheckBoxIncludeSubdirectories=รวมถึงไดเรคทอรี่ย่อย
GroupBoxOptions=ทางเลือก
GroupBoxSearchDirectoryOptions=การค้นหาไดเรคทอรี่ทางเลือก

[SearchOptionsDialog]
CheckBoxBeepIfSearchStringNotFound=Beep ถ้าข้อความการค้นหาไม่ค้นพบ
CheckBoxCaseSensitive=กรณีรู้สึกอ่อนไหว
CheckBoxEntireScope=Entire scope
CheckBoxEntireScope:t=Translation needed
CheckBoxHighlightResult=Highlight results
CheckBoxHighlightResult:t=Translation needed
CheckBoxRegularExpression=การแสดงออกประจำ
CheckBoxSearchOnTyping=Search on typing
CheckBoxSearchOnTyping:t=Translation needed
CheckBoxSelectedOnly=Selected only
CheckBoxSelectedOnly:t=Translation needed
CheckBoxShowSearchStringNotFound=แสดงข้อความการค้นหาไม่ข้อความค้นพบ
CheckBoxWildCard=Wildcard
CheckBoxWildCard:t=Translation needed
CheckBoxWholeWordsOnly=คำทั้งหมดเท่านั้น
ButtonOK=ตกลง(OK)
ButtonCancel=ยกเลิก

[ReplaceDialog]
ButtonCancel=ยกเลิก
Caption=แทนที่
CheckBoxCaseSensitive=กรณีรู้สึกอ่อนไหว
ButtonFind=&การค้นหา
GroupBoxOptions=ทางเลือก
ButtonReplaceAll=&แทนที่ทั้งหมด
GroupBoxReplaceIn=แทนที่ใน
RadioButtonWholeFile=ไฟล์ ทั้งหมด
RadioButtonAllOpenFiles=เปิดไฟล์ ทั้งหมด
RadioButtonReplaceWith=แทนที่ด้วย
RadioButtonDeleteLine=ลบเส้น
ComboBoxSearchFor=ค้นหาเพื่อ
CheckBoxWholeWordsOnly=คำทั้งหมดเท่านั้น
CheckBoxRegularExpression=การแสดงออกประจำ
CheckBoxWildCard=Wildcard
CheckBoxPromptOnReplace=แทนที่บนPrompt

[PrintPreviewDialog]
ActionColors=Colors
ActionColors:h=Toggle colors
ActionExit=Exit
ActionExit:h=Exit the print preview
ActionFirst=First
ActionFirst:h=1|ไปยังหน้าที่ 1
ActionHighlight=Highlight
ActionHighlight:h=Toggle highlight
ActionLast=Last
ActionLast:h=สุดท้าย|ไปยังหน้าสุดท้าย
ActionLineNumbers=Line Numbers
ActionLineNumbers:h=เปลี่ยนจำนวนเส้น
ActionNext=Next
ActionNext:h=ถัดไป|ไปที่หน้าถัดไป
ActionPrevious=Previous
ActionPrevious:h=ที่ผ่านมา|ไปที่หน้าที่ผ่านมา
ActionPrint=Print
ActionPrint:h=การพิมพ์|พิมพ์เอกสาร
ActionWordWrap=Word wrap
ActionWordWrap:h=เปลี่ยนword wrap
ActionZoomIn=Zoom in
ActionZoomIn:h=Zoom in
ActionZoomOut=Zoom out
ActionZoomOut:h=Zoom out
ActionZoom=Zoom
ActionZoom:h=ซูม|ซูมใน/ออก
Caption=การพิมพ์ตัวอย่าง (Print Preview)

[SearchForFilesForm]
Caption=ค้นหาไฟล์
PanelSearchingFiles=การค้นหาไฟล์...

[OptionsEditorCaretFrame]
CheckBoxVisible=Visible
CheckBoxVisible:t=Translation needed
CheckBoxRightMouseClickMovesCaret=Right mouse click moves caret
CheckBoxRightMouseClickMovesCaret:t=Translation needed
GroupBoxNonBlinkingCaret=Non-blinking caret
GroupBoxNonBlinkingCaret:t=Translation needed
CheckBoxNonblinkingCaretEnabled=Enabled
CheckBoxNonblinkingCaretEnabled:t=Translation needed
ColorBoxNonblinkingCaretBackground=Background color
ColorBoxNonblinkingCaretBackground:t=Translation needed
ColorBoxNonblinkingCaretForeground=Foreground color
ColorBoxNonblinkingCaretForeground:t=Translation needed
GroupBoxStyles=Styles
GroupBoxStyles:t=Translation needed
ComboBoxStylesInsertCaret=Insert
ComboBoxStylesInsertCaret:t=Translation needed
ComboBoxStylesOverwriteCaret=Overwrite
ComboBoxStylesOverwriteCaret:t=Translation needed

[OptionsEditorCodeFoldingFrame]
CheckBoxVisible=Visible
CheckBoxVisible:t=Translation needed
CheckBoxFoldMultilineComments=Fold multiline comments
CheckBoxFoldMultilineComments:t=Translation needed
CheckBoxHighlightIndenGuides=Highlight indent guides
CheckBoxHighlightIndenGuides:t=Translation needed
CheckBoxHighlightMatchingPair=Highlight matching pair
CheckBoxHighlightMatchingPair:t=Translation needed
CheckBoxShowCollapsedCodeHint=Show collapsed code hint
CheckBoxShowCollapsedCodeHint:t=Translation needed
CheckBoxShowCollapsedLine=Show collapsed line
CheckBoxShowCollapsedLine:t=Translation needed
CheckBoxShowIndentGuides=Show indent guides
CheckBoxShowIndentGuides:t=Translation needed
CheckBoxUncollapseByHintClick=Uncollapse by hint click
CheckBoxUncollapseByHintClick:t=Translation needed
ComboBoxMarkStyle=Mark style
ComboBoxMarkStyle:t=Translation needed

[OptionsEditorColorFrame]
ComboBoxColor=Color
ComboBoxColor:t=Translation needed
ComboBoxHighlighter=Highlighter
ComboBoxHighlighter:t=Translation needed
TabSheetEditor=Editor
TabSheetEditor:t=Translation needed
ComboBoxEditorElement=Element
ComboBoxEditorElement:t=Translation needed
ColorComboBoxEditorColor=Color
ColorComboBoxEditorColor:t=Translation needed
TabSheetElements=Elements
TabSheetElements:t=Translation needed
ComboBoxElementsName=Name
ComboBoxElementsName:t=Translation needed
ColorComboBoxElementsForeground=Foreground
ColorComboBoxElementsForeground:t=Translation needed
ColorComboBoxElementsBackground=Background
ColorComboBoxElementsBackground:t=Translation needed
GroupBoxAttributes=Attributes
GroupBoxAttributes:t=Translation needed
CheckBoxElementsAttributesBold=Bold
CheckBoxElementsAttributesBold:t=Translation needed
CheckBoxElementsAttributesItalic=Italic
CheckBoxElementsAttributesItalic:t=Translation needed
CheckBoxElementsAttributesUnderline=Underline
CheckBoxElementsAttributesUnderline:t=Translation needed
TabSheetGeneral=General
TabSheetGeneral:t=Translation needed
EditVersion=Version
EditVersion:t=Translation needed
DateEditDate=Date
DateEditDate:t=Translation needed
TabSheetAuthor=Author
TabSheetAuthor:t=Translation needed
EditName=Name
EditName:t=Translation needed
EditEmail=Email
EditEmail:t=Translation needed
TabSheetSkin=Skin
TabSheetSkin:t=Translation needed
LabelSkinDescription=Use skin color for selected elements
LabelSkinDescription:t=Translation needed
CheckBoxSkinActiveLineBackground=Active line background
CheckBoxSkinActiveLineBackground:t=Translation needed
CheckBoxSkinForeground=Foreground
CheckBoxSkinForeground:t=Translation needed
CheckBoxSkinSelectionForeground=Selection foreground
CheckBoxSkinSelectionForeground:t=Translation needed
CheckBoxSkinLeftMarginBackground=Left margin background
CheckBoxSkinLeftMarginBackground:t=Translation needed
CheckBoxSkinCodeFoldingBackground=Code folding background
CheckBoxSkinCodeFoldingBackground:t=Translation needed
CheckBoxSkinCompletionProposalBackground=Completion proposal background
CheckBoxSkinCompletionProposalBackground:t=Translation needed
CheckBoxSkinBackground=Background
CheckBoxSkinBackground:t=Translation needed
CheckBoxSkinSelectionBackground=Selection background
CheckBoxSkinSelectionBackground:t=Translation needed
CheckBoxSkinBookmarkPanelBackground=Bookmark panel background
CheckBoxSkinBookmarkPanelBackground:t=Translation needed
CheckBoxSkinCodeFoldingHintBackground=Code folding hint background
CheckBoxSkinCodeFoldingHintBackground:t=Translation needed
CheckBoxSkinCompletionProposalSelectionBackground=Completion proposal selection background
CheckBoxSkinCompletionProposalSelectionBackground:t=Translation needed

[AboutDialog]
Caption=เกี่ยวกับ EditBone
CopyrightLabel=ลิขสิทธิ์ %s. ขอสงวนลิขสิทธิ์ทั้งหมด.
MemoryAvailableLabel=หน่วยความจำมีให้เพื่อวินโดว์ส: %s
ButtonOK=OK
DonationsButton=การบริจาค
DevelopmentEnvironmentLabel=สภาพแวดล้อมการพัฒนา
ThirdPartyComponentsLabel=ส่วนประกอบกลุ่มที่ 3
LanguageFileContributorsLabel=ผู้เขียนเรื่องให้หนังสือพิมพ์ไฟล์ภาษา
IconsLabel=ไอคอน
VersionLabel=เวอร์ชัน %s (%d-bit)

[DirectoryTabDialog]
ButtonCancel=ยกเลิก
ExcludeOtherBranchesAction=เว้นสาขาไดเรคทอรี่อื่นๆ
ButtonOK=&ตกลง(OK)
ComboBoxRootDirectory=ไดเรคทอรี่ราก
DrivesLabel=ไดร์ว
ComboBoxFileMask=หน้ากากแฟ้ม
TabNameLabel=ชื่อแถบ
GroupBoxOptions=ทางเลือก

[OptionsForm]
ButtonCancel=ยกเลิก
Caption=ข้อกำหนด
EditorAction=ผู้แก้ไข
EditorFontAction=แบบอักษร
EditorLeftMarginAction=ส่วนที่เกินซ้าย
EditorRightMarginAction=ส่วนที่เกินที่ใช่
EditorActionSearchSearch=การค้นหา
EditorCompletionProposalAction=ข้อเสนอการทำเสร็จ
EditorErrorCheckingAction=การตรวจข้อผิดพลาด HTML
DirectoryAction=ไดเรคทอรี่
DirectoryTabsAction=แถบ
EditorOtherAction=อื่นๆ
OutputAction=ผลผลิต
OutputTabsAction=แถบ
CompareAction=เปรียบเทียบไฟล์
ActionPrint=การพิมพ์
MainMenuAction=เมนูหลัก
ToolBarAction=แถบเครื่องมือ
StatusBarAction=แถบสถานะ
FileTypesAction=ชนิดไฟล์
SQLFormatterAction=แบบแผน SQL
SQLAlignmentsAction=ตั้งให้ตรง
SQLCapitalizationAction=Capitalization
SQLIndentationAction=ร่นเข้าไป
SQLInsertAction=ใส่
SQLSelectAction=เลือก
SQLUpdateAction=ของใหม่
SQLWhitespaceAction=Whitespace
ButtonOK=&ตกลง(OK)

[OptionsEditorOptionsFrame]
AutoIndentCheckBox=ไม่รอยเว้าอัตโนมัติ
AutoSaveCheckBox=บันทึกอัตโนมัติ
NonblinkingCaretCheckBox=เคื่องหมายตกที่ไม่กะพริบ
NonblinkingCaretColorLabel=สีพื้นหลังเครื่องหมายตกที่ไม่ที่กะพริบ
NonblinkingCaretFontColorLabel=สีแบบอักษรเครื่องหมายตกที่ไม่ที่กะพริบ
UndoAfterSaveCheckBox=ยกเลิกหลังบันทึก
TrimTrailingSpacesCheckBox=ตกแต่งการสะกดรอยช่องว่าง
ScrollPastEofCheckBox=โดยการเลื่อนผ่านไปถึงไฟล์สุดท้าย
ScrollPastEolCheckBox=โดยการเลื่อนผ่านไปถึงบรรทัดสุดท้าย
TabsToSpacesCheckBox=แถบเพื่อช่องว่าง
SmartTabsCheckBox=Line spacing
SmartTabDeleteCheckBox=Smart tabs
LineSpacingLabel=การช่องว่างบรรทัดLine spacing
TabWidthLabel=ความกว้างแถบ
InsertCaretLabel=Insert caret
TripleClickRowSelectCheckBox=สาม-กดเลือกแถวนอน
ShowScrollHintCheckBox=Show scroll hint
NonblinkingCaretColorBox=ประเพณี

[OptionsEditorFontFrame]
ComboBoxColor=Color
ComboBoxColor:t=Transalation needed
ComboBoxElement=Element
ComboBoxElement:t=Transalation needed
FontComboBoxFont=Font
FontComboBoxFont:t=Transalation needed
EditFontSize=Font size
EditFontSize:t=Transalation needed

[OptionsEditorLeftMarginFrame]
CheckBoxAutoSize=ขนาดอัตโนมัติ
CheckBoxShowAfterLastLine=แสดงหมายเลขเส้นหลังเส้นสุดท้าย
CheckBoxShowBookmarkPanel=แสดงป้ายที่คั่นหนังสือ
CheckBoxShowBookmarks=แสดงที่คั่นหนังสือ
CheckBoxShowInTens=จำนวนเส้นใน 10
CheckBoxShowLeadingZeros=จำนวนเส้นเริ่มต้นศูนย์
CheckBoxShowLineState=แสดงเส้นที่ปรับแต่ง
CheckBoxVisible=มองเห็นได้
EditBookmarkPanelWidth=Bookmark panel width
EditBookmarkPanelWidth:t=Translation needed
EditWidth=ความกว้าง
GroupBoxLineNumbers=Line numbers
GroupBoxLineNumbers:t=Translation needed

[OptionsEditorRightMarginFrame]
CheckBoxVisible=มองเห็นได้
MouseMoveCheckBox=การเคลื่อนที่เม้าท์
PositionLabel=ตำแหน่ง

[OptionsEditorSearchFrame]
DocumentSpecificSearchCheckBox=การค้นหาที่เจาะจงเอกสาร
ShowSearchMapCheckBox=แสดงแผนที่การค้นหา
ShowSearchHighlighterCheckBox=แสดงนักส่องแสงการค้นหา

[OptionsEditorTabsFrame]
MultilineCheckBox=Multiline
ShowCloseButtonCheckBox=แสดงปุ่มปืด
ShowImageCheckBox=แสดงรูปภาพ
CloseTabByDblClickCheckBox=ปิดแถบโดยdouble-click
CloseTabByMiddleClickCheckBox=ปิดแถบโดยmiddle-click
DoubleBufferedCheckBox=Double buffered
SaveTabsCheckBox=บันทึกแถบ
RightClickSelectCheckBox=กดเม้าท์ขวาเลือก

[OptionsEditorCompletionProposalFrame]
CheckBoxEnabled=สามารถทำได้
CheckBoxCaseSensitive=กรณีรู้สึกอ่อนไหว
ComboBoxShortcut=ทางลัด

[OptionsEditorErrorCheckingFrame]
HTMLErrorCheckingCheckBox=ทำให้=ใช้ได้
HTMLVersionLabel=เวอร์ชันเมื่อ DOCTYPE ไม่มีอยู่

[OptionsEditorOtherFrame]
CPASHighlighterLabel=C พื้นฐาน / Pascal  highlighter
dialect SQLDialectLabel=SQL
 HTMLVersionLabel=HTMLเวอร์ชัน
 CSSVersionLabel=CSS เวอร์ชัน
PHPVersionLabel=PHP เวอร์ชัน
DefaultEncodingLabel=การเข้ารหัสพื้นฐาน
DefaultHighlighterLabel=Default highlighter

[OptionsDirectoryFrame]
ShowTreeLinesCheckBox=Show tree lines
ShowHiddenFilesCheckBox=แสดงไฟล์ซ่อนเร้น
ShowSystemFilesCheckBox=แสดงไฟล์ระบบ
ShowArchiveFilesCheckBox=แสดงไฟล์เอกสารสำคัญ
ShowOverlayIconsCheckBox=แสดงทับไอคอน
IndentLabel=Indent

[OptionsOutputFrame]
ShowTreeLinesCheckBox=Show tree lines
ShowCheckBoxCheckBox=Show check box
IndentLabel=Indent

[OptionsDirectoryTabsFrame]
MultilineCheckBox=Multiline
ShowCloseButtonCheckBox=แสดงปุ่มปิด
ShowImageCheckBox=แสดงรูปภาพ
CloseTabByDblClickCheckBox=ปิดแถบโดยกด double-click
CloseTabByMiddleClickCheckBox=ปิดแถบโดยmiddle-click
DoubleBufferedCheckBox=Double buffered
SaveTabsCheckBox=บันทึกแถบ
RightClickSelectCheckBox=กดเม้าท์ขวาเลือก

[OptionsOutputTabsFrame]
MultilineCheckBox=Multiline
ShowCloseButtonCheckBox=แสดงปุ่มปิด
ShowImageCheckBox=แสดงรูปภาพ
CloseTabByDblClickCheckBox=แถบปิดโดยกด double-click
CloseTabByMiddleClickCheckBox=แถบปิดโดยmiddle-click
DoubleBufferedCheckBox=Double buffered
SaveTabsCheckBox=บันทึกแถบ
RightClickSelectCheckBox=กดเม้าท์ขวาเลือก

[OptionsCompareFrame]
IgnoreCaseCheckBox=ไม่สนใจกรณี
IgnoreBlanksCheckBox=ไม่สนใจความว่างเปล่า

[OptionsPrintFrame]
DocumentNameLabel=ชื่อเอกสาร
PageNumberLabel=จำนวนหน้า
PrintedByLabel=พิมพ์โดย
DateTimeLabel=เวลาวันที่
ShowHeaderLineCheckBox=แสดงเส้นหัวข้อ
ShowFooterLineCheckBox=แสดงเส้นข้อความท้ายหน้า
ShowLineNumbersCheckBox=แสดงจำนวนเส้น
WordWrapCheckBox=Word wrap


[OptionsFileTypesFrame]
ExtensionsLabel=ส่วนขยาย
VirtualDrawTree:0=ชนิดไฟล์

[OptionsMainMenuFrame]
PersistentHotKeysCheckBox=Persistent hotkeys
ShadowsCheckBox=เงา
UseSystemFontCheckBox=ใช้ระบบแบบอักษร
SelectFontAction:h=เลือกแบบอักษร
AnimationStyleLabel=สไตล์ภาพเคลื่อนไหว
AnimationDurationLabel=ความต่อเนื่องภาพเคลื่อนไหว

[OptionsToolBarFrame]
VirtualDrawTree:h=ใช้เมาท์ลากและทิ้งเพื่อเคลื่อนย้ายรายการเมนู. กดเม้าท์ขวาเมนูเล็กๆเพื่อใส่และลบรายการ.
VirtualDrawTree:0=รายการเมนู
AddItemAction=เพิ่มรายการ
AddItemAction:h=เพิ่มรายการ
DeleteAction=ลบ
DeleteAction:h=ลบ
AddDividerAction=เพิ่มนักหาร
AddDividerAction:h=เพิ่มนักหาร
ResetAction=คืนค่า
ResetAction:h=คืนค่ารายการเมนู

[OptionsToolBarItemsDialog]
Caption=เลือกรายการ
VirtualDrawTreeAddItems:0=รายการเมนู
ButtonAdd=เพิ่ม
ButtonCancel=ยกเลิก

[InsertTagDialog]
Caption=ใส่ HTML/XML ติดป้าย
ButtonOK=ตกลง(OK)
ButtonCancel=ยกเลิก

[OptionsStatusBarFrame]
UseSystemFontCheckBox=ใช้ระบบแบบอักษร
SelectFontAction:h=เลือกแบบอักษร

[DirectoryFrame]
DirectoryCloseAction:h=ปิดไดเรคทอรี่ที่ใช้งาน
DirectoryCloseAction=&ปิดไดเรคทอรี่
DirectoryCloseAction:s=Shif+Ctrl+D
DirectoryDeleteAction:h=ลบไฟล์หรือไดเรคทอรี่
DirectoryDeleteAction=&ลบ
DirectoryEditAction:h=แก้ไขไดเรคทอรี่ที่ใช้งาน
DirectoryEditAction=&แก้ไขไดเรคทอรี่
DirectoryEditAction:s=Shif+Ctrl+E
DirectoryOpenAction:h=เปิดไดเรคทอรี่ใหม่
DirectoryOpenAction=&เปิดไดเรคทอรี่
DirectoryOpenAction:s=Ctrl+D
DirectoryRefreshAction:h=Refresh files
DirectoryRefreshAction=&Refresh
DirectoryRenameAction:h=เปลี่ยนชื่อไฟล์หรือไดเรคทอรี่
DirectoryRenameAction=เปลี่ยน&ชื่อ
DirectoryPropertiesAction:h=ดูไฟล์/คุณสมบัติไดเรคทอรี่
DirectoryPropertiesAction=&คุณสมบัติ...
DirectoryFilesAction=&ไฟล์...
DirectoryFilesAction:h=การค้นหาไฟล์จากไดเรคทอรี่ที่เลือกและไดเรคทอรี่ย่อยของมัน
DirectoryFilesAction:s=Ctrl+F12
DirectoryContextMenuAction= เมนู&ตายตัว
DirectoryContextMenuAction:h=เมนูตายตัว

[DocumentFrame]
CheckBoxCaseSensitive=กรณีรู้สึกอ่อนไหว
SearchClearAction:h=ลบล้างClear)
SearchCloseAction:h=ปิดการค้นหา
ActionSearchFindNext:h=ค้นหาข้อความที่จับคู่ถัดไป
ActionSearchFindNext:s=F3
ActionSearchFindPrevious:h=ค้นหาข้อความที่จับคู่ที่ผ่านมา
ActionSearchFindPrevious:s=การเปลี่ยนแปลง+F3
ComboBoxSearchFor=ค้นหาเพื่อ
WholeWordsOnlyCheckBox=คำทั้งหมดเท่านั้น
CheckBoxRegularExpression=การแสดงออกประจำ
CheckBoxWildCard=Wildcard
XMLTreeRefreshAction:h=Refresh XML tree
XMLTreeRefreshAction=&Refresh
GotoLineAction:h=ไปที่เส้น
GotoLineCloseAction:h=ปิด
GotoLineLabel=ไปที่เส้น
GotoLineClearAction:h=Clear

[CompareFrame]
CopySelectionLeftAction:h=เลือกทำสำเนาไปทางด้านซ้าย
CopySelectionRightAction:h=เลือกทำสำเนาไปทางด้านขวา
FindNextDifferenceAction:h=ค้นหาความแตกต่างถัดไป
LeftDocumentButtonClickAction:h=เปิดเอกสาร
LeftLabel=แถวนอนด้านซ้าย
OpenDocumentsLeftAction:h=เปิดเอกสาร
OpenDocumentsRightAction:h=เปิดเอกสาร
RefreshAction:h=Refresh documents
RightDocumentButtonClickAction:h=เปิดเอกสาร
RightLabel=แถวนอนด้านขวา
SaveLeftGridAction:h=บันทึกเอกสาร
SaveRightGridAction:h=บันทึกเอกสาร

[OutputFrame]
CloseAllOtherPagesAction:h=เลือกอื่นๆทั้งหมด
CloseAllOtherPagesAction=เลือกหน้า&อื่นๆทั้งหมด
OutputCloseAction:h=ปิดหน้าปัจจุบัน
OutputCloseAction=&ปิด
OutputCloseAllAction:h=ปิดหน้าทั้งหมด
OutputCloseAllAction=ปิด&ทั้งหมด
CopyAllToClipboardAction=ทำ&สำเนา ทั้งหมดเพื่อคลิปบอร์ด
CopyAllToClipboardAction:h=ทำสำนาทั้งหมดสู่คลิปบอร์ด
CopySelectedToClipboardAction=ทำสำนาเลือกเพื่อคลิปบอร์ด
CopySelectedToClipboardAction:h=ทำสำนาเลือกเพื่อคลิปบอร์ด
OpenAllAction=&เปิดทั้งหมด
OpenAllAction:h=เปิดไฟล์ทั้งหมด
OpenSelectedAction=&เลือกเปิด
OpenSelectedAction:h=ไฟล์ที่เลือกเปิด
SelectAllAction=เลือกทั้งหมด
SelectAllAction:h=เลือกไฟล์ทั้งหมด
UnselectAllAction=ไม่เลือกทั้งหมด
UnselectAllAction:h=ไม่เลือกไฟล์ทั้งหมด

[SQLFormatterConstant]
Stacked=Stacked
Wrapped=Wrapped
AfterComma=หลังจุดจุลภาค
BeforeComma=ก่อนจุดจุลภาค
BeforeCommaWithSpace=ก่อนจุดจุลภาคกับช่องว่าง
NoLineBreak=ไม่มีแตกบรรทัด
BeforeAndOr=ก่อนและ/หรือ
AfterAndOr=หลังและ/หรือ
Left=ด้านซ้าย
Right=ด้านขวา
None=ไม่มี
Uppercase=ตัวพิมพ์ใหญ่
Uppercase=ตัวพิมพ์เล็ก
SentenceCase=กรณีประโยค
NoChange=ไม่มีการแลกเปลี่ยน

[OptionsSQLAlignmentsFrame]
KeywordAlignLabel=คำค้นอยู่ในเส้นตรง
KeywordAlignmentLeftJustifyCheckBox=ทางซ้ายเคร่งครัดตั้งให้ตรงคำค้น

[OptionsSQLCapitalizationFrame]
KeywordsLabel=คำค้น
IdentifierLabel=ผู้ค้นหา
QuotedIdentifierLabel=ผู้ค้นหาที่อ้าง
TableNameLabel=ชื่อตาราง
ColumnNameLabel=ชื่อคอลัมภ์
AliasNameLabel=ชื่ออีกชื่อหนึ่ง
VariableNameLabel=ชื่อตัวแปร
FunctionNameLabel=ชื่อฟังก์ชัน
ComboBoxDataType=ชนิดข้อมูล

[OptionsSQLFormatterFrame]
DatabaseLabel=ฐานข้อมูล

[OptionsSQLIndentationFrame]
IndentLengthLabel=ไม่รอยเว้าความยาว
UseTabCheckBox=ใช้แถบ
TabSizeLabel=ขนาดแถบ
FunctionBodyIndentLabel=ร่างกายฟังก์ชันไม่รอยเว้า
BlockOnNewLineCheckBox=สะกัดบนบรรทัดใหม่
BlockLeftIndentSizeLabel=กล่องทิ้งไม่รอยเว้าขนาด
BlockRightIndentSizeLabel=สิทธ์กล่องไม่รอยเว้าขนาด
BlockIndentSizeLabel=กล่องไม่รอยเว้าขนาด
SingleStatementIndentLabel=ถ้า/มิฉะนั้นแถลงการณ์เดี่ยวไม่รอยเว้าขนาด

[OptionsSQLInsertFrame]
ColumnListStyleLabel=สไตล์รายการคอลัมภ์
ValueListStyleLabel=สไตล์รายการค่า
InsertColumnsPerLineLabel=ใส่คอลัมภ์ต่อบรรทัด
ParenthesisInSeparateLinesCheckBox=วงเล็บในบรรทัดที่แยกออกมา

[OptionsSQLSelectFrame]
ColumnListTabSheet=รายการคอลัมภ์
SubqueryTabSheet=Subquery
IntoClauseTabSheet=เข้าไปในอนุประโยค
FromJoinClauseTabSheet=จาก/เข้าร่วมอนุประโยค
AndOrKeywordTabSheet=และ/หรือคำค้น
GroupByClauseTabSheet=กลุ่มโดยอนุประโยค
HavingClauseTabSheet=มีอนุประโยค
OderByClauseTabSheet=สั่งโดยอนุประโยค
ColumnListStyleLabel=สไตล์
ColumnListLineBreakLabel=บรรทัดพัง
AlignAliasCheckBox=อยู่ในเส้นตรงชื่ออีกชื่อหนึ่ง
ColumnInNewLineCheckBox=คอลัมภ์ในบรรทัดใหม่
TreatDistinctAsVirtualColumnCheckBox=สิ่งที่ทำให้เพลิดเพลินที่แตกต่างเป็นคอลัมภ์เสมือนจริง
NewLineAfterInCheckBox=บรรทัดใหม่หลังใน
NewLineAfterExistsCheckBox=บรรทัดใหม่หลังมีอยู่
NewlineAfterComparisonOperatorCheckBox=หน่วยงานหลักใหม่หลังพนักงานโทรศัพท์การเปรียบเทียบ
NewlineBeforeComparisonOperatorCheckBox=หน่วยงานหลักใหม่ก่อนพนักงานโทรศัพท์การเปรียบเทียบ
IntoClauseInNewLineCheckBox=เข้าไปในอนุประโยคในบรรทัดใหม่
FromClauseStyleLabel=สไตล์
FromClauseInNewLineCheckBox=จากอนุประโยคในบรรทัดใหม่
JoinClauseInNewLineCheckBox=เข้าร่วมอนุประโยคในบรรทัดใหม่
AlignJoinWithFromKeywordCheckBox=อยู่ในเส้นตรงเข้าร่วมกับจากคำค้น
AlignAndOrWithOnInJoinClauseCheckBox=อยู่ในเส้นตรงและ/หรือกับบนในเข้าร่วมอนุประโยค
AlignAliasInFromClauseCheckBox=อยู่ในเส้นตรงชื่ออีกชื่อหนึ่งในจากอนุประโยค
AndOrLineBreakLabel=บรรทัดพัง
AndOrUnderWhereCheckBox=และ/หรือใต้ที่ซึ่ง
WhereClauseInNewlineCheckBox=ที่ซึ่งอนุประโยคในบรรทัดใหม่
WhereClauseAlignExprCheckBox=ที่ซึ่งอนุประโยคอยู่ในเส้นตรง expr
GroupByClauseStyleLabel=สไตล์
GroupByClauseInNewLineCheckBox=กลุ่มโดยอนุประโยคในบรรทัดใหม่
HavingClauseInNewLineCheckBox=มีอนุประโยคในบรรทัดใหม่
OrderByClauseStyleLabel=สไตล์
OrderByClauseInNewLineCheckBox=สั่งโดยอนุประโยคในบรรทัดใหม่

[OptionsSQLUpdateFrame]
ColumnListStyleLabel=สไตล์รายการคอลัมภ์

[OptionsSQLWhitespaceFrame]
SpaceAroundOperatorCheckBox=ช่องว่างรอบ ผู้กระทำของ การแสดงออก arithmetric
SpaceInsideCreateCheckBox=ช่องว่างข้างในวงเล็บในสร้างฟังก์ชัน/โพรซิเดอร์
SpaceInsideExpressionCheckBox=ช่องว่างข้างในวงเล็บในการแสดงออก
SpaceInsideSubqueryCheckBox=ช่องว่างข้างในวงเล็บใน subquery
SpaceInsideFunctionCheckBox=ช่องว่างข้างในวงเล็บในการเรียกฟังก์ชัน
SpaceInsideTypenameCheckBox=ช่องว่างข้างใน วงเล็บของ typename ในสร้างตาราง

[LanguageEditorForm]
ActionFileNew:h=สร้างไฟล์ภาษาใหม่
ActionFileOpen:h=เปิดไฟล์ภาษาที่มีอยู่
ActionFileSave:h=บันทึกไฟล์ภาษา
CloseAction:h=ปิดตัวแก้ภาษา
VirtualDrawTree:0=วัตถุ
VirtualDrawTree:1=หัวเรื่อง
VirtualDrawTree:2=การใบ้
VirtualDrawTree:3=ทางลัด

[ConvertForm]
Caption=แปลงระหว่าง numerical หน่วย
ComboBoxType=ชนิด
ComboBoxFrom=จาก
ComboBoxTo=เพื่อ
EditValue=ค่า
EditResult=ผลลัพธ์

[ConvertConstant]
Distance=ระยะ
Micromicrons=Micromicrons
Angstroms=Angstroms
Millimicrons=Millimicrons
Microns=Microns
Millimeters=มิลลิเมตร
Centimeters=เซ็นติเมตร
Decimeters=Decimeters
Meter=มิเตอร์
Decameters=Decameters
Hectometers=Hectometers
Kilometers=กิโลเมตร
Megameters=Megameters
Gigameters=Gigameters
Inches=นิ้ว
Feet=ฟุต
Yards=หลา
Miles=ไมล์
NauticalMiles=ไมล์เกี่ยวกับทะเล
AstronomicalUnits=หน่วยเกี่ยวกับการดูดาว
LightYears=ปีแสง
Parsecs=Parsecs
Cubits=ศอก
Fathoms=ระยะแขน
Furlongs=Furlongs
Hands=มือ
Paces=Paces
Rods=Rods
Chains=Chains
Links=Links
Picas=Picas
Points=จุด
Area=พื้นที่
SquareMillimeters=มิลลิเมตรเท่าเทียมกัน
SquareCentimeters=เซ็นติเมตรเท่าเทียมกัน
SquareDecimeters=decimeters เท่าเทียมกัน
SquareMeters=มิเตอร์เท่าเทียมกัน
SquareDecameters=decameters เท่าเทียมกัน
SquareHectometers=hectometers เท่าเทียมกัน
SquareKilometers=กิโลเมตรเท่าเทียมกัน
SquareInches=จตุรัสนิ้ว
SquareFeet=เท้าเท่าเทียมกัน
SquareYards=ลานบ้านเท่าเทียมกัน
SquareMiles=ไมล์เท่าเทียมกัน
Acres=เอเคอร์
Centares=Centares
Ares=คือ
Hectares=Hectares
SquareRods=แขนงไม้เท่าเทียมกัน
Volume=ปริมาณ
CubicMillimeters=ลูกบาศ์กมิลลิเมตร
CubicCentimeters=ลูกบาศ์กเซ็นติเมตร
CubicDecimeters=ลูกบาศ์ก decimeters
CubicMeters=ลูกบาศ์กมิเตอร์
CubicDecameters=ลูกบาศ์ก decameters
CubicHectometers=ลูกบาศ์ก hectometers
CubicKilometers=ลูกบาศ์กกิโลเมตร
CubicInches=ลูกบาศ์กนิ้ว
CubicFeet=ลูกบาศ์กเท้า
CubicYards=ลูกบาศ์กลานบ้าน
CubicMiles=ลูกบาศ์กไมล์
MilliLiters=Milli ลิตร
CentiLiters=Centi ลิตร
DeciLiters=หนึ่งในสิบลิตร
Liters=ลิตร
DecaLiters=Deca ลิตร
HectoLiters=Hecto ลิตร
KiloLiters=กิโลลิตร
AcreFeet=เท้าเอเคอร์
AcreInches=เอเคอร์นิ้ว
Cords=ด้าย
CordFeet=เท้าเชือก
Decisteres=Decisteres
Steres=Steres
Decasteres=Decasteres
FluidGallons=ของเหลวแกลอน
FluidPints= 1/8ควอร์ตของไหล
FluidQuarts=quarts ของไหล
FluidCups=ถ้วยของไหล
FluidGills=เหงือกปลาของไหล
FluidOunces=ounces ของไหล
FluidTablespoons=ช้อนโต๊ะของไหล
FluidTeaspoons=teaspoons ของไหล
DryGallons=ทำให้แห้งแกลอน
DryQuarts=quarts แห้ง
DryPints= 1/8ควอร์ตแห้ง
DryPecks=ทำให้แห้งจิก
DryBuckets=ถังแห้ง
DryBushels=ตะกร้าแห้ง
UKGallons=แกลอนอังกฤษ
UKPottle=pottles อังกฤษ
UKQuarts=quarts อังกฤษ
UKPints= 1/8ควอร์ตอังกฤษ
UKGill=เหงือกปลาอังกฤษ
UKOunces=ounces อังกฤษ
UKPecks=จิกอังกฤษ
UKBuckets=ถังอังกฤษ
UKBushels=ตะกร้าอังกฤษ
Mass=มวล
Nanograms=Nanograms
Micrograms=Micrograms
Milligrams=มิลลิกรัม
Centigrams=เซนติกรัม
Decigrams=Decigrams
Grams=กรัม
Decagrams=เดซิกรัม
Hectograms=Hectograms
Kilograms=กิโลกรัม
MetricTons=เมตริกตัน
Drams=Drams
Grains=Grains
LongTons=ตันนาน
Tons=ตัน
Ounces=เอาวน์
Pounds=ปอนด์
Stones=Stones
NumeralSystem=ระบบตัวเลข
Binary=เลขฐาน 2
Decimal=ทศนิยม
Hexadecimal=เลขฐาน 16
Temperature=อุณหภูมิ
Celsius=เซ็ลเซียส
Kelvin=ชื่อหน่วยวัดอุณหภูมิ ใช้สัญลักษณ์ K
Fahrenheit=เกี่ยวกับอุณหภูมิฟาห์เรนไฮท์
Time=เวลา
Reaumur=Reaumur
Rankine=Rankine
MilliSeconds=วินาที
Seconds=วินาที
Minutes=นาที
Hours=ชั่วโมง
Days=วัน
Weeks=สัปดาห์
Fortnights=Fortnights
Months=เดือน
Years=ปี
Decades=ทศวรรษ
Centuries=ศตวรรษ
Millennia=Millennia
DateTime=วันที่เวลา
JulianDate=วันที่จูเรียน
ModifiedJulianDate=วันที่จูเรียนที่แก้ไข
